===========================
./CANCEL_TICKET/cancel_10_tickets_service
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
8 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CAN 1111 0008 0000 R000001 20181004
> EOS 0000 0 0000 ** 0




===========================
./CANCEL_TICKET/cancel_20_tickets_session
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
8 is not a valid command.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0001 is not a valid command.
Enter Command
5 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,3
< EOS 0000 0 0000 ** 0
---
> CAN 1111 0008 0000 R000001 20181004
> CAN 1112 0005 0001 R000001 20181004
> EOS 0000 0 0000 ** 0




===========================
./CANCEL_TICKET/cancel_more_than_10_service
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
11 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/cancel_more_than_20_session
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
10 is not a valid command.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0001 is not a valid command.
Enter Command
9 is not a valid command.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0002 is not a valid command.
Enter Command
5 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/cancel_negative_tickets_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
-3 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/cancel_negative_tickets_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
-5 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/cancel_tickets_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
35 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CAN 1111 0035 0000 R000001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/invalid_destination_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0505 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/invalid_service_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/valid_destination_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
1 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CAN 1111 0001 0000 R000001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CANCEL_TICKET/valid_service_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
0000 is not a valid command.
Enter Command
1 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CAN 1111 0001 0000 R000001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_agent_ticket_limit
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
21 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./CHANGE_TICKET/change_current_service_number_check
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_invalid_current_service_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
0 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_invalid_new_service_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
0 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_invalid_ticket_number_zero
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
0 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_new_service_number_check
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_ticket_number_check
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_unlimited_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
21 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CHG 1111 0021 2222 R00001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_valid_to_valid_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
1 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CHG 1111 0001 2222 R00001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CHANGE_TICKET/change_valid_to_valid_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
change is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
1 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CHG 1111 0001 2222 R00001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_date_above_d_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,3
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004 
> EOS 0000 0 0000 ** 0
> 




===========================
./CREATE_SERVICE/assign_service_date_above_m_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,3
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
> 




===========================
./CREATE_SERVICE/assign_service_date_above_y_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_date_below_d_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,3
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
> 




===========================
./CREATE_SERVICE/assign_service_date_below_m_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_date_below_y_range
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_date_invalid_format
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_name_begin_space
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_name_end_space
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_name_large
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_name_small
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_number_0_start
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Invalid input: service number cannot begin with 0.
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_number_duplicate
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 
Enter month: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_number_large
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Invalid input: service number must be exactly 5 characters.
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/assign_service_number_non_digit
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Invalid input: service number must be exactly 5 characters.
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0




===========================
./CREATE_SERVICE/assign_service_number_small
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Invalid input: service number must be exactly 5 characters.
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/create_new_service_valid
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter a new service number: 
Enter a new service name: 
Enter year: 


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> CRE 00000 0000 12345 NEWSERVICE 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./CREATE_SERVICE/create_service_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Cannot create a service during agent session.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/cancelticket_deleted_service
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter desired service number: 
Error: Service number does not exist
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> empty transaction summary file
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/deleteservice_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Cannot delete a service during agent session.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/get_service_name
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter an existing service number: 
Service number does not exist; cannot delete.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/get_service_number
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter an existing service number: 


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/invalid_service_number
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter an existing service number: 
Service number does not exist; cannot delete.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./DELETE_SERVICE/valid_service_number
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Enter an existing service number: 
Service number does not exist; cannot delete.
Enter Command
hello is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> 1111 hello 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./LOGIN/agent_createservice
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Cannot create a service during agent session.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/agent_deleteservice
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Cannot delete a service during agent session.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/invalid_session_type_empty
===========================

Enter Command
Enter user type
Error: User type exit does not exist.
Enter Command


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/invalid_session_type_numeric
===========================

Enter Command
Enter user type
Error: User type 8838 does not exist.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/invalid_session_type_string
===========================

Enter Command
Enter user type
Error: User type spice does not exist.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/login_first
===========================

Enter Command
Enter a new service number: 


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/login_session_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/login_session_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/login_twice_agent
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Error: You are already logged in.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/login_twice_planner
===========================

Enter Command
Enter user type
Successfully logged in as planner.
Enter Command
Error: You are already logged in.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/start_front_end_session
===========================

Enter Command
Enter user type
Error: User type exit does not exist.
Enter Command


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGIN/valid_services_file_read
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0




===========================
./LOGOUT/login_accepted_after_logout
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter a new service number: 


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./LOGOUT/logout_not_logged_in
===========================

Enter Command
Error: You are not logged in.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./LOGOUT/only_login_accepted_after_logout
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter a new service number: 


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./LOGOUT/transaction_summary_file
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
Enter a new service number: 


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_existing_service_one
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
1 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> SEL 1111 0001 0000 R00001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_existing_service_two
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
2 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1,2
< EOS 0000 0 0000 ** 0
---
> SEL 1111 0002 0000 R00001 20181004
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_invalid_service_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
2222 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_invalid_ticket_number
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
0 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_service_number_check
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




===========================
./SELL_TICKET/sell_ticket_number_check
===========================

Enter Command
Enter user type
Successfully logged in as agent.
Enter Command
sell is not a valid command.
Enter Command
ticket is not a valid command.
Enter Command
1111 is not a valid command.
Enter Command
Successfully logged out.
Enter Command
Force exiting...


DIFF

1c1
< EOS 0000 0 0000 ** 0
---
> EOS 0000 0 0000 ** 0
\ No newline at end of file




